Revit 2016 API
Level.LevelType Property
 The level style of this level.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Syntax
C#
[ObsoleteAttribute("This property is deprecated in Revit 2016. Use GetTypeId() and ChangeTypeId() instead.")]
public LevelType LevelType { get; set; }
Visual Basic
<ObsoleteAttribute("This property is deprecated in Revit 2016. Use GetTypeId() and ChangeTypeId() instead.")> _
Public Property LevelType As LevelType
	Get
	Set
Visual C++
[ObsoleteAttribute(L"This property is deprecated in Revit 2016. Use GetTypeId() and ChangeTypeId() instead.")]
public:
property LevelType^ LevelType {
	LevelType^ get ();
	void set (LevelType^ value);
}
See Also
Level Class
Autodesk.Revit.DB Namespace